In [1]:
%load_ext watermark
%watermark -u -d -v

last updated: 2017-01-22

CPython 3.5.2
IPython 5.1.0

In [2]:
%matplotlib inline

In [3]:
import numpy as np
import matplotlib.pyplot as plt
from pandas import Series, DataFrame
import pandas as pd

# Chapter 5 Getting Started with pandas

## Introduction to pandas Data Structures
### Series

In [3]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [9]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [10]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [11]:
'b' in obj2

True

In [12]:
'e' in obj2

False

* dict から生成

In [14]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [15]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index = states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

* 欠損値

In [16]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [17]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [18]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

* 名前
    * 列名
    * テーブル名

In [20]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [22]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [25]:
obj.index.name = 'column'
obj.name = 'series'
obj

column
Bob      4
Steve    7
Jeff    -5
Ryan     3
Name: series, dtype: int64

### DataFrame

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [27]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [29]:
frame2 = DataFrame(data, 
                   columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [30]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [31]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [33]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [34]:
frame2['debt']

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
Name: debt, dtype: object

In [35]:
frame2['debt'] = 16.5
frame2['debt']

one      16.5
two      16.5
three    16.5
four     16.5
five     16.5
Name: debt, dtype: float64

In [36]:
frame2['debt'] = np.arange(5.)
frame2['debt']

one      0.0
two      1.0
three    2.0
four     3.0
five     4.0
Name: debt, dtype: float64

In [37]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [38]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [39]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [41]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [42]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [43]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [44]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [45]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [46]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [47]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [48]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index Objects

In [49]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [50]:
index[1:]

Index(['b', 'c'], dtype='object')

index は変更不可．
これはエラー

In [ ]:
index[1] = 'd'

In [52]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [53]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [55]:
'Ohio' in frame3.columns

True

In [56]:
2003 in frame3.index

False

## Essential Functionality
### Reindexing

In [57]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [58]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [59]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [61]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [62]:
frame = DataFrame(np.arange(9).reshape((3, 3)), 
                  index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [63]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [64]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [65]:
frame.reindex(index=['a', 'b', 'c', 'd'], 
              method='ffill', 
              columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [66]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

In [67]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [68]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [69]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [70]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [71]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [72]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [75]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [76]:
obj = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [77]:
obj['a']

0.0

In [78]:
obj[0]

0.0

In [79]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [80]:
obj[['b', 'd', 'c']]

b    1.0
d    3.0
c    2.0
dtype: float64

In [81]:
obj[[3, 1]]

d    3.0
b    1.0
dtype: float64

In [82]:
obj[obj < 3]

a    0.0
b    1.0
c    2.0
dtype: float64

In [83]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [84]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [85]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [86]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [88]:
data[['two', 'one']]

          two  one
Ohio        1    0
Colorado    5    4
Utah        9    8
New York   13   12

In [89]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [90]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [92]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [94]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [95]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [96]:
data.ix['Utah']

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [97]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [98]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [99]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [100]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [101]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [102]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                 index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [103]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [104]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [105]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [106]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [107]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [108]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [109]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [110]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [111]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [112]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [113]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [114]:
series = frame.ix[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [115]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [116]:
series2 = Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int32

In [118]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [119]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [120]:
frame.sub(series3, axis = 0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [121]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.194253  2.120384  0.366992
Ohio    0.053552  0.665597  1.439469
Texas   0.753622 -2.504979  0.846599
Oregon -0.659705  0.942140  0.120086

In [122]:
frame.abs()

               b         d         e
Utah    1.194253  2.120384  0.366992
Ohio    0.053552  0.665597  1.439469
Texas   0.753622  2.504979  0.846599
Oregon  0.659705  0.942140  0.120086

In [123]:
np.abs(frame)

               b         d         e
Utah    1.194253  2.120384  0.366992
Ohio    0.053552  0.665597  1.439469
Texas   0.753622  2.504979  0.846599
Oregon  0.659705  0.942140  0.120086

In [126]:
f = lambda x: x.max() - x.min()
f

In [127]:
frame.apply(f)

b    1.853958
d    4.625363
e    1.319383
dtype: float64

In [128]:
frame.apply(f, axis = 1)

Utah      1.753392
Ohio      1.385918
Texas     3.351578
Oregon    1.601845
dtype: float64

In [129]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
f

In [130]:
frame.apply(f)

            b         d         e
min -0.659705 -2.504979  0.120086
max  1.194253  2.120384  1.439469

In [131]:
frame.apply(f, axis = 1)

             min       max
Utah    0.366992  2.120384
Ohio    0.053552  1.439469
Texas  -2.504979  0.846599
Oregon -0.659705  0.942140

In [132]:
format = lambda x: '%.2f' % x
format

In [133]:
frame.applymap(format)

            b      d     e
Utah     1.19   2.12  0.37
Ohio     0.05   0.67  1.44
Texas    0.75  -2.50  0.85
Oregon  -0.66   0.94  0.12

In [134]:
frame['e'].map(format)

Utah      0.37
Ohio      1.44
Texas     0.85
Oregon    0.12
Name: e, dtype: object

### Sorting and ranking

In [135]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [136]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [137]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [139]:
frame.sort_index(ascending=False)

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [142]:
obj = Series([4, 7, -3, 2])
# obj.order() # deprecated
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [143]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [144]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [146]:
# frame.sort_index(by = 'b') # deprecated
frame.sort_values(by = 'b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [147]:
# frame.sort_index(by = 'b') # deprecated
frame.sort_values(by = ['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

* タイは平均

In [148]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

* method='first'で先に出てきたものが上

In [149]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [150]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [151]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [152]:
frame.rank(axis = 1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [153]:
frame.rank()

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

### Axis indexes with duplicate values

In [154]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [155]:
obj.index.is_unique

False

In [156]:
obj['a']

a    0
a    1
dtype: int32

In [157]:
obj['c']

4

In [158]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.752287 -0.591022 -0.247574
a -1.039342 -0.590430  1.678264
b -2.983389 -0.078000 -0.675173
b -0.239130  0.194851 -0.220136

In [160]:
df.ix['a']

          0         1         2
a -0.752287 -0.591022 -0.247574
a -1.039342 -0.590430  1.678264

## Summarizing and Computing Descriptive Statistics

In [161]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [162]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [163]:
df.sum(axis = 1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [164]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [165]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [169]:
df.idxmax()

one    b
two    d
dtype: object

In [170]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [173]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [174]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [175]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

`pandas.io.data` は `pandas-datareader` に分離

```
conda install pandas-datareader
```
`0.2.1` が入る（最新版は`0.3.0`）

---

`dict.iteritems()` は Python3 では削除

* `dict.items` を使う?

```
pydoc -p 1234
```
で `localhost:1234` からドキュメントが見られる

In [4]:
# import pandas.io.data as web
import pandas_datareader.data as web

In [15]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

percent change

In [17]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2017-01-09  0.009159  0.000620 -0.011090 -0.003183
2017-01-10  0.001009 -0.002306 -0.012705 -0.000319
2017-01-11  0.005373  0.003877  0.013473  0.009103
2017-01-12 -0.004175 -0.001919  0.001192 -0.009179
2017-01-13 -0.001761  0.001885 -0.003632  0.001437

correlation (Series)

In [18]:
returns.MSFT.corr(returns.IBM)

0.49678673972837339

covariance (Series)

In [19]:
returns.MSFT.cov(returns.IBM)

8.6961239530001922e-05

In [20]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.411552  0.383898  0.393515
GOOG  0.411552  1.000000  0.402753  0.472016
IBM   0.383898  0.402753  1.000000  0.496787
MSFT  0.393515  0.472016  0.496787  1.000000

In [21]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000271  0.000106  0.000076  0.000094
GOOG  0.000106  0.000247  0.000076  0.000108
IBM   0.000076  0.000076  0.000145  0.000087
MSFT  0.000094  0.000108  0.000087  0.000212

In [22]:
returns.corrwith(returns.IBM)

AAPL    0.383898
GOOG    0.402753
IBM     1.000000
MSFT    0.496787
dtype: float64

In [23]:
returns.corrwith(volume)

AAPL   -0.073683
GOOG   -0.008532
IBM    -0.200727
MSFT   -0.091744
dtype: float64

### Unique Values, Value Counts, and Membership

In [4]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [5]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [7]:
pd.value_counts(obj.values, sort=False)

b    2
a    3
d    1
c    3
dtype: int64

In [8]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [9]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [10]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [12]:
data.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [11]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling Missing Data

In [5]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [8]:
from numpy import nan as NA

In [9]:
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = DataFrame([
        [1., 6.5, 3.], 
        [1., NA, NA],
        [NA, NA, NA], 
        [NA, 6.5, 3.]
    ])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4]= NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  1.010709  0.192184 -0.468940
1  0.003572 -0.498981 -0.115948
2 -0.887683 -1.576370  0.126426
3 -1.048615 -0.059246  0.549581
4 -0.169915  1.564039  2.315245
5 -0.456702 -0.142591  1.474124
6 -1.426663  1.707211  1.013786

In [18]:
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0  1.010709       NaN       NaN
1  0.003572       NaN       NaN
2 -0.887683       NaN       NaN
3 -1.048615       NaN  0.549581
4 -0.169915       NaN  2.315245
5 -0.456702 -0.142591  1.474124
6 -1.426663  1.707211  1.013786

3つ以上値が残っているもの

In [32]:
df.dropna(thresh=3)

          0         1         2
5 -0.456702 -0.142591  1.474124
6 -1.426663  1.707211  1.013786

### Filling in Missing Data

In [20]:
df.fillna(0)

          0         1         2
0  1.010709  0.000000  0.000000
1  0.003572  0.000000  0.000000
2 -0.887683  0.000000  0.000000
3 -1.048615  0.000000  0.549581
4 -0.169915  0.000000  2.315245
5 -0.456702 -0.142591  1.474124
6 -1.426663  1.707211  1.013786

In [34]:
df.fillna({1: 0.5, 2: -1})

          0         1         2
0  1.010709  0.500000 -1.000000
1  0.003572  0.500000 -1.000000
2 -0.887683  0.500000 -1.000000
3 -1.048615  0.500000  0.549581
4 -0.169915  0.500000  2.315245
5 -0.456702 -0.142591  1.474124
6 -1.426663  1.707211  1.013786

In [35]:
_ = df.fillna(0, inplace=True)

In [36]:
df

          0         1         2
0  1.010709  0.000000  0.000000
1  0.003572  0.000000  0.000000
2 -0.887683  0.000000  0.000000
3 -1.048615  0.000000  0.549581
4 -0.169915  0.000000  2.315245
5 -0.456702 -0.142591  1.474124
6 -1.426663  1.707211  1.013786

In [37]:
df = DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.228411  1.275637 -0.057889
1 -0.207758  0.514683  0.741807
2  0.572556 -1.070287 -0.739634
3  0.252936 -1.084875 -0.306913
4  0.737004  0.056568  1.627271
5  0.386483 -1.633294  1.464812

In [38]:
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0  0.228411  1.275637 -0.057889
1 -0.207758  0.514683  0.741807
2  0.572556       NaN -0.739634
3  0.252936       NaN -0.306913
4  0.737004       NaN       NaN
5  0.386483       NaN       NaN

In [39]:
df.fillna(method='ffill')

          0         1         2
0  0.228411  1.275637 -0.057889
1 -0.207758  0.514683  0.741807
2  0.572556  0.514683 -0.739634
3  0.252936  0.514683 -0.306913
4  0.737004  0.514683 -0.306913
5  0.386483  0.514683 -0.306913

In [40]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.228411  1.275637 -0.057889
1 -0.207758  0.514683  0.741807
2  0.572556  0.514683 -0.739634
3  0.252936  0.514683 -0.306913
4  0.737004       NaN -0.306913
5  0.386483       NaN -0.306913

In [42]:
data = Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [43]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical Indexing

In [4]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.016160
   2   -1.027926
   3   -0.401875
b  1   -0.171377
   2   -0.429054
   3    0.606372
c  1   -1.407373
   2   -0.923220
d  2   -1.280930
   3   -1.106973
dtype: float64

In [5]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [6]:
data['b']

1   -0.171377
2   -0.429054
3    0.606372
dtype: float64

In [7]:
data['b':'c']

b  1   -0.171377
   2   -0.429054
   3    0.606372
c  1   -1.407373
   2   -0.923220
dtype: float64

In [8]:
data.ix[['b', 'd']]

b  1   -0.171377
   2   -0.429054
   3    0.606372
d  2   -1.280930
   3   -1.106973
dtype: float64

In [9]:
data[:, 2]

a   -1.027926
b   -0.429054
c   -0.923220
d   -1.280930
dtype: float64

In [10]:
data.unstack()

          1         2         3
a  0.016160 -1.027926 -0.401875
b -0.171377 -0.429054  0.606372
c -1.407373 -0.923220       NaN
d       NaN -1.280930 -1.106973

In [11]:
data.unstack().stack()

a  1    0.016160
   2   -1.027926
   3   -0.401875
b  1   -0.171377
   2   -0.429054
   3    0.606372
c  1   -1.407373
   2   -0.923220
d  2   -1.280930
   3   -1.106973
dtype: float64

In [5]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [14]:
frame.index.names

FrozenList([None, None])

In [6]:
frame.index.names = ['key1', 'key2']
frame.index.names

FrozenList(['key1', 'key2'])

In [16]:
frame.columns.names

FrozenList([None, None])

In [7]:
frame.columns.names = ['state', 'color']
frame.columns.names

FrozenList(['state', 'color'])

In [18]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [19]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [27]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### Reordering and Sorting Levels

In [9]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [10]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [13]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [14]:
frame.swaplevel('key1', 'key2').index

MultiIndex(levels=[[1, 2], ['a', 'b']],
           labels=[[0, 1, 0, 1], [0, 0, 1, 1]],
           names=['key2', 'key1'])

In [15]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [17]:
frame.sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary Statistics by Level

In [19]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [20]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame’s Columns

In [21]:
frame = DataFrame({'a': range(7), 
                   'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [22]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [23]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [24]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas Topics
### Integer Indexing

index の番号か名前かがわからいので，エラーになる

In [26]:
ser = Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [ ]:
# error
# ser[-1]

こちらはならない

In [27]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [28]:
ser2[-1]

2.0

In [29]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [31]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3

-5    0
 1    1
 3    2
dtype: int32

In [33]:
## ser3.iget_value(2) # depricated
ser3.iloc[2]

2

or

In [35]:
ser3.iat[2]

2

In [36]:
frame = DataFrame(np.arange(6).reshape(3, 2), index=[2, 0, 1])
frame

   0  1
2  0  1
0  2  3
1  4  5

In [38]:
# frame.irow(0) # depricated
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int32

### Panel Data

In [39]:
import pandas_datareader.data as web

In [40]:
pdata = pd.Panel(
    dict(
        (stk, web.get_data_yahoo(stk)) for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1795 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2017-01-20 00:00:00
Minor_axis axis: Open to Adj Close

In [41]:
pdata = pdata.swapaxes('items', 'minor')
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1795 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2010-01-04 00:00:00 to 2017-01-20 00:00:00
Minor_axis axis: AAPL to MSFT

In [42]:
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   27.847252  14.06528  313.062468  25.710416
2010-01-05   27.895396  14.38450  311.683844  25.718722
2010-01-06   27.451683  14.10397  303.826685  25.560888
2010-01-07   27.400936  14.23940  296.753749  25.295062
2010-01-08   27.583106  14.36516  300.709808  25.469510
2010-01-11   27.339779  14.37483  300.255255  25.145534
2010-01-12   27.028789  14.56830  294.945572  24.979392
2010-01-13   27.410045  14.57797  293.252243  25.211991
2010-01-14   27.251297  14.22005  294.630868  25.718722
2010-01-15   26.795872  13.92985  289.710772  25.635652
2010-01-19   27.981276  14.32646  293.516976  25.835022
2010-01-20   27.550575  14.03626  289.915587  25.411360
2010-01-21   27.074331  13.92017  291.199286  24.929550
2010-01-22   25.731480  13.18982  274.730736  24.057305
2010-01-25   26.423726  13.43650  269.730740  24.356361
2010-01-26   26.797173  13.13662  270.939526  24.505889
2010-01-27   27.049609  13.08825  270.779695  24.647109
2010-01-28   25.931866  12.84641  266.878565  24.223448
2010-01-29   24.991091  12.47882  264.705742  23.409354
2010-02-01   25.338514  12.78837  266.244198  23.600417
2010-02-02   25.485551  12.86576  265.295156  23.641951
2010-02-03   25.924059  12.92380  270.140309  23.783172
2010-02-04   24.989789  12.58523  263.127321  23.126913
2010-02-05   25.433503  12.80772  265.380075  23.276441
2010-02-08   25.259140  12.95282  266.468996  23.027228
2010-02-09   25.528492  13.10760  267.952522  23.268134
2010-02-10   25.389262  13.30107  266.958496  23.251519
2010-02-11   25.851191  13.49454  267.932539  23.359512
2010-02-12   26.073698  13.38813  266.294170  23.201677
2010-02-16   26.466665  13.67834  270.380071  23.660703
...                ...       ...         ...        ...
2016-12-07  111.029999       NaN  771.190002  61.369999
2016-12-08  112.120003       NaN  776.419983  61.009998
2016-12-09  113.949997       NaN  789.289978  61.970001
2016-12-12  113.300003       NaN  789.270020  62.169998
2016-12-13  115.190002       NaN  796.099976  62.980000
2016-12-14  115.190002       NaN  797.070007  62.680000
2016-12-15  115.820000       NaN  797.849976  62.580002
2016-12-16  115.970001       NaN  790.799988  62.299999
2016-12-19  116.639999       NaN  794.200012  63.619999
2016-12-20  116.949997       NaN  796.419983  63.540001
2016-12-21  117.059998       NaN  794.559998  63.540001
2016-12-22  116.290001       NaN  791.260010  63.549999
2016-12-23  116.519997       NaN  789.909973  63.240002
2016-12-27  117.260002       NaN  791.549988  63.279999
2016-12-28  116.760002       NaN  785.049988  62.990002
2016-12-29  116.730003       NaN  782.789978  62.900002
2016-12-30  115.820000       NaN  771.820007  62.139999
2017-01-03  116.150002       NaN  786.140015  62.580002
2017-01-04  116.019997       NaN  786.900024  62.299999
2017-01-05  116.610001       NaN  794.020020  62.299999
2017-01-06  117.910004       NaN  806.150024  62.840000
2017-01-09  118.989998       NaN  806.650024  62.639999
2017-01-10  119.110001       NaN  804.789978  62.619999
2017-01-11  119.750000       NaN  807.909973  63.189999
2017-01-12  119.250000       NaN  806.359985  62.610001
2017-01-13  119.040001       NaN  807.880005  62.700001
2017-01-17  120.000000       NaN  804.609985  62.529999
2017-01-18  119.989998       NaN  806.070007  62.500000
2017-01-19  119.779999       NaN  802.174988  62.299999
2017-01-20  120.000000       NaN  805.020020  62.740002

[1795 rows x 4 columns]

In [43]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   72.996726
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.093451

In [44]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   72.473644  14.58765  300.100412  26.248896
2012-05-23   74.241986  12.08221  304.426106  25.675584
2012-05-24   73.560156  12.04351  301.528978  25.640302
2012-05-25   73.165884  12.05319  295.470050  25.631482
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   74.464493  12.24666  296.873645  26.072491
2012-05-30   75.362333  12.14992  293.821674  25.878448
2012-05-31   75.174961  11.92743  290.140354  25.746145
2012-06-01   72.996726  11.67592  285.205295  25.093451
2012-06-04   73.426126  11.60821  289.006480  25.181652
2012-06-05   73.236155  11.76298  284.920579  25.146372
2012-06-06   74.359101  11.81619  289.995487  25.887268
2012-06-07   74.392930  11.73396  288.826666  25.781425
2012-06-08   75.511971  11.72429  289.935570  26.151873
2012-06-11   74.321360  11.47278  283.966519  25.490359
2012-06-12   74.970668  11.57919  282.268201  25.834347
2012-06-13   74.450185  11.87423  280.265216  25.693223
2012-06-14   74.368205  11.93711  279.246220  25.878448
2012-06-15   74.706521  11.89841  281.973510  26.478221
2012-06-18   76.222432  12.01449  285.140358  26.319457
2012-06-19   76.434536  11.78233  290.475012  27.077994
2012-06-20   76.217227  11.89841  288.467038  27.280858
2012-06-21   75.167150  11.60821  282.323161  26.584062
2012-06-22   75.743588  11.80168  285.455033  27.077994
2012-06-25   74.269317  11.55500  280.070407  26.345918
2012-06-26   74.433270  11.53565  282.058429  26.478221
2012-06-27   74.754665  11.92743  284.366112  26.610524
2012-06-28   74.045503  11.55984  281.873596  26.381198
2012-06-29   75.990821  12.10155  289.745749  26.980972
2012-07-02   77.099452  11.98064  289.945546  26.954511
...                ...       ...         ...        ...
2016-12-07  111.029999       NaN  771.190002  61.369999
2016-12-08  112.120003       NaN  776.419983  61.009998
2016-12-09  113.949997       NaN  789.289978  61.970001
2016-12-12  113.300003       NaN  789.270020  62.169998
2016-12-13  115.190002       NaN  796.099976  62.980000
2016-12-14  115.190002       NaN  797.070007  62.680000
2016-12-15  115.820000       NaN  797.849976  62.580002
2016-12-16  115.970001       NaN  790.799988  62.299999
2016-12-19  116.639999       NaN  794.200012  63.619999
2016-12-20  116.949997       NaN  796.419983  63.540001
2016-12-21  117.059998       NaN  794.559998  63.540001
2016-12-22  116.290001       NaN  791.260010  63.549999
2016-12-23  116.519997       NaN  789.909973  63.240002
2016-12-27  117.260002       NaN  791.549988  63.279999
2016-12-28  116.760002       NaN  785.049988  62.990002
2016-12-29  116.730003       NaN  782.789978  62.900002
2016-12-30  115.820000       NaN  771.820007  62.139999
2017-01-03  116.150002       NaN  786.140015  62.580002
2017-01-04  116.019997       NaN  786.900024  62.299999
2017-01-05  116.610001       NaN  794.020020  62.299999
2017-01-06  117.910004       NaN  806.150024  62.840000
2017-01-09  118.989998       NaN  806.650024  62.639999
2017-01-10  119.110001       NaN  804.789978  62.619999
2017-01-11  119.750000       NaN  807.909973  63.189999
2017-01-12  119.250000       NaN  806.359985  62.610001
2017-01-13  119.040001       NaN  807.880005  62.700001
2017-01-17  120.000000       NaN  804.609985  62.529999
2017-01-18  119.989998       NaN  806.070007  62.500000
2017-01-19  119.779999       NaN  802.174988  62.299999
2017-01-20  120.000000       NaN  805.020020  62.740002

[1188 rows x 4 columns]

In [45]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900.0
           DELL    12.110000   12.112500   11.800000   12.000000   17015700.0
           GOOG   570.220958  580.491016  570.011006  578.590973    4883500.0
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300.0
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600.0
           DELL    11.950000   12.240000   11.950000   12.160000   15620900.0
           GOOG   575.451008  578.131003  566.470986  570.410999    4697200.0
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400.0
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900.0
           DELL    12.210000   12.280000   12.090000   12.215000   20779900.0
           GOOG   576.480979  581.970971  573.611004  580.570966    4207200.0
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500.0
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700.0
           DELL    12.320000   12.410000   12.120000   12.130000   20074000.0
           GOOG   587.601014  587.891038  577.251006  578.230986    3530100.0
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800.0
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100.0
           DELL    12.130000   12.225000   12.020000   12.120000   18155600.0
...                      ...         ...         ...         ...          ...
2017-01-06 AAPL   116.779999  118.160004  116.470001  117.910004   31577900.0
           GOOG   795.260010  807.900024  792.203979  806.150024    1620500.0
           MSFT    62.299999   63.150002   62.040001   62.840000   19897900.0
2017-01-09 AAPL   117.949997  119.430000  117.940002  118.989998   33387600.0
           GOOG   806.400024  809.966003  802.830017  806.650024    1272400.0
           MSFT    62.759998   63.080002   62.540001   62.639999   20256600.0
2017-01-10 AAPL   118.769997  119.379997  118.300003  119.110001   24420800.0
           GOOG   807.859985  809.130005  803.510010  804.789978    1174300.0
           MSFT    62.730000   63.070000   62.279999   62.619999   18547000.0
2017-01-11 AAPL   118.739998  119.930000  118.599998  119.750000   27418600.0
           GOOG   805.000000  808.150024  801.369995  807.909973    1057900.0
           MSFT    62.610001   63.230000   62.430000   63.189999   21462800.0
2017-01-12 AAPL   118.900002  119.300003  118.209999  119.250000   27002400.0
           GOOG   807.140015  807.390015  799.169983  806.359985    1351000.0
           MSFT    63.060001   63.400002   61.950001   62.610001   20898900.0
2017-01-13 AAPL   119.110001  119.620003  118.809998  119.040001   25938300.0
           GOOG   807.479980  811.223999  806.690002  807.880005    1090100.0
           MSFT    62.619999   62.869999   62.349998   62.700001   19350400.0
2017-01-17 AAPL   118.339996  120.239998  118.220001  120.000000   34078600.0
           GOOG   807.080017  807.140015  800.369995  804.609985    1355800.0
           MSFT    62.680000   62.700001   62.029999   62.529999   20620400.0
2017-01-18 AAPL   120.000000  120.500000  119.709999  119.989998   23644700.0
           GOOG   805.809998  806.205017  800.989990  806.070007    1293300.0
           MSFT    62.669998   62.700001   62.119999   62.500000   19646500.0
2017-01-19 AAPL   119.400002  120.089996  119.370003  119.779999   25295700.0
           GOOG   805.119995  809.479980  801.799988  802.174988     912000.0
           MSFT    62.240002   62.980000   62.200001   62.299999   18435500.0
2017-01-20 AAPL   120.449997  120.449997  119.730003  120.000000   29479900.0
           GOOG   806.909973  806.909973  801.690002  805.020020    1645000.0
           MSFT    62.669998   62.820000   62.369999   62.740002   29467500.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.362333
           DELL    12.149920
           GOOG   293.821674
           MSFT    25.878448
2012-05-31 AAPL    75.174961
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.746145
2012-06-01 AAPL    72.996726
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.093451
2012-06-04 AAPL    73.426126
           DELL    11.608210
           GOOG   289.006480
           MSFT    25.181652
2012-06-05 AAPL    73.236155
           DELL    11.762980
           GOOG   284.920579
           MSFT    25.146372
2012-06-06 AAPL    74.359101
           DELL    11.816190
           GOOG   289.995487
           MSFT    25.887268
2012-06-07 AAPL    74.392930
           DELL    11.733960
           GOOG   288.826666
           MSFT    25.781425
2012-06-08 AAPL    75.511971
           DELL    11.724290
...                      ...
2017-01-06 AAPL   117.910004
           GOOG   806.150024
           MSFT    62.840000
2017-01-09 AAPL   118.989998
           GOOG   806.650024
           MSFT    62.639999
2017-01-10 AAPL   119.110001
           GOOG   804.789978
           MSFT    62.619999
2017-01-11 AAPL   119.750000
           GOOG   807.909973
           MSFT    63.189999
2017-01-12 AAPL   119.250000
           GOOG   806.359985
           MSFT    62.610001
2017-01-13 AAPL   119.040001
           GOOG   807.880005
           MSFT    62.700001
2017-01-17 AAPL   120.000000
           GOOG   804.609985
           MSFT    62.529999
2017-01-18 AAPL   119.989998
           GOOG   806.070007
           MSFT    62.500000
2017-01-19 AAPL   119.779999
           GOOG   802.174988
           MSFT    62.299999
2017-01-20 AAPL   120.000000
           GOOG   805.020020
           MSFT    62.740002

[3877 rows x 6 columns]

In [46]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1182 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2017-01-20 00:00:00
Minor_axis axis: AAPL to MSFT

In [47]:
imports = %imports_
%watermark -u -d -v -p $imports

last updated: 2017-01-22

CPython 3.5.2
IPython 5.1.0

pandas 0.19.2
numpy 1.11.3
pandas_datareader 0.2.1
matplotlib 1.5.3